app/controllers/auth/sessions_controller.rb

  def create

    super

    session[:user_id] = current_user.id
    session[:roleinfo] = current_user.make_roles_info_arr
    session[:user] = current_user

    Throttling.for(:user_signin).check(:user_id, cached_current_user.id) do
      # Do your stuff here
      raise Exception.new "너무 자주 로그인을 시도 중입니다."
      return
    end

    cached_current_user.data.incr_level_upgrade_value(:login_cnt)
    cached_current_user.data.incr_level_upgrade_value(:visit_days) if is_morethan_1day_passed

    if !cached_current_user.exclude_autoupgrade # 자동 레벨 업 제외가 아니면
      if cached_current_user.level_upgrade_if_can
        flash[:notice] = "회원레벨이 올라갔습니다. 감사합니다. 새 레벨: #{cached_current_user.level}"
      end
    end

    # 로그 저장
    UserLog.create_log(request, cached_current_user.id, true, :login, "로그인 하였습니다.")
---
INSERT INTO `user_logs` (`user_id`, `event_name`, `reason`, `ip`, `useragent`, `created_at`) VALUES (1, 'login', '로그인 하였습니다.', '115.89.250.237', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/115...', '2023-08-02 03:54:59')