app/controllers/admin/menus_controller.rb

SELECT `menus`.* FROM `menus`
---
  def index
    @menus = Menu.all

SELECT `menus`.* FROM `menus` WHERE `menus`.`id` = 1 LIMIT 1
---
    def set_menu
      @menu = Menu.find(params[:id])