app/controllers/admin/users_controller.rb

SELECT COUNT(*) FROM `users` WHERE (1 AND (deleted_at is null) )
---
    def do_index_actions

      @recnum = params[:recnum].present? ? params[:recnum].to_i : 15
      @where = params[:where] || 'name'
      @page = params[:page].present? ? params[:page].to_i : 1
      @keyword = params[:keyword] || ''
      @sort = params[:sort] || "id"
      @orderby = params[:orderby] || "desc"
      @with_deleted = (params[:with_deleted].to_i || 0) > 0

      where_list = %w(name nick email level)

      where_str = "1 "
      #where_str += "AND (board_id = #{@board_id}) " if @board_id != ''

      where1 = where_list.include?(params[:where]) ? params[:where] : 'name'
      where_str += "AND (#{where1} like '%#{@keyword}%') " if @keyword != ''
      where_str += "AND (deleted_at is null) " if !@with_deleted

      @total_count = User.where(where_str).count