app/helpers/application_helper.rb

  def board_name_for(board_id) # board_id = integer
    Rails.cache.fetch("board/#{board_id}/name", expires_in: 1.day) do
      board = Board.find(board_id);
---
SELECT `boards`.* FROM `boards` WHERE `boards`.`id` = 4 LIMIT 1

  def board_group_id_for(bgid)
    Rails.cache.fetch("board_group/#{bgid}/id", expires_in: 1.day) do
      BoardGroup.find_by(bgid: bgid)&.id
---
SELECT `board_groups`.* FROM `board_groups` WHERE `board_groups`.`bgid` = 'humor' LIMIT 1