app/controllers/posts_controller.rb

    def set_board
      #board_id = params[:board_id] || (params[:post] && post_params[:board_id])
      @bid = params[:bid] || (params[:post] && post_params[:bid])
      @board = Board.cached_board_by_bid(@bid)
      @category = params[:cat]
      category_str = @board&.category&.to_s || ""
      @category_arr = category_str.split(',').map(&:strip).select { |x| x!='' }
      #@category_arr.unshift ""

      #raise ActiveRecord::RecordNotFound unless @board.present?
      unless @board.present?
---
SELECT `boards`.* FROM `boards` WHERE `boards`.`bid` = 'jaemiphoto' LIMIT 1

    def set_board_group

      @bgid = params[:bgid]
      @board_group = BoardGroup.find_by(bgid: @bgid)
---
SELECT `board_groups`.* FROM `board_groups` WHERE `board_groups`.`bgid` = 'main' LIMIT 1

    def inc_hit
      if first_read_in_session then
        @post.hit += 1
        @post.simple_update_mode = true
        @post.save
---
UPDATE `posts` SET `posts`.`hit` = 2, `posts`.`updated_at` = '2023-08-02 04:03:30' WHERE `posts`.`id` = 6188