app/models/board.rb

SELECT `users`.* FROM `users` INNER JOIN `users_roles` ON `users_roles`.`user_id` = `users`.`id` INNER JOIN `roles` ON `roles`.`id` = `users_roles`.`role_id` WHERE ((((roles.name = 'moderator') AND (roles.resource_type IS NULL) AND (roles.resource_id IS NULL)) OR ((roles.name = 'moderator') AND (roles.resource_type = 'Board') AND (roles.resource_id IS NULL)) OR ((roles.name = 'moderator') AND (roles.resource_type = 'Board') AND (roles.resource_id = 4))))
---
  def moderators(cached = true)
    if cached
      Rails.cache.fetch("user_role/moderators/board/#{id}", expires_in: 10.minutes) do
        moderators(false)
      end
    else
      users = User.with_role(:moderator, self).uniq
      users.select { |u| u.has_strict_role? :moderator, self }

SELECT `boards`.* FROM `boards` WHERE `boards`.`bid` = 'free' LIMIT 1
---
  def self.cached_board_by_bid(bid)
    Rails.cache.fetch("boards/bid/#{bid}", expires_in: 10.minutes) do
      Board.find_by(bid: bid)

SELECT COUNT(*) FROM `posts` WHERE (board_id = 4 and created_at >= '2023-07-31 03:54:07.946764')
---
  def self.recent_posts_count(board_id, interval)
    #interval == timestanp (int)
    Post.where("board_id = ? and created_at >= ?", board_id, Time.now - interval).count