app/models/level.rb

  def self.check_if_autoupgrade_enabled?(current_level)
    level_data = Level.where('level = ?', current_level).first
---
SELECT `levels`.* FROM `levels` WHERE (level = 1) ORDER BY `levels`.`id` ASC LIMIT 1