app/models/menu.rb

SELECT `menus`.* FROM `menus` WHERE `menus`.`name` = 'main' LIMIT 1
---
  def self.get_menu(name)
    Rails.cache.fetch("menu/name/#{name}", expires_in: 10.minutes) do
      menu = Menu.find_by(name: name)