app/models/point_log.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def sender
    User.find(self.by_user_id)

INSERT INTO `point_logs` (`user_id`, `by_user_id`, `point`, `reason`, `created_at`) VALUES (1, 1, 20, '로그인에 대한 포인트', '2023-08-02 03:54:59')
---
  def self.create_log_admin(user_id, point, reason)
    # 0 이면 기록하지 않음
    return if point == 0

    PointLog.create(
      user_id: user_id,
      by_user_id: User::superadmin_id,
      point: point,
      reason: reason,
    )