app/models/post.rb

SELECT id,gid,board_id,board_group_id,bid,site_id,display,hidden,notice,depth,user_id,name,nick,subject,category,files_cnt,hit,favor_cnt,unfavor_cnt,comment_cnt,report_cnt,deleted,created_at,updated_at FROM `posts` WHERE `posts`.`id` = 6188 ORDER BY `posts`.`id` ASC LIMIT 1
---
  def self.post_for_listing(post_id)
    id = post_id.is_a?(Post) ? post_id.id : post_id
    Post.where(id: id).select(POST_ATTRS__FOR_LISTING.join(",")).first