app/models/user_log.rb

INSERT INTO `user_logs` (`user_id`, `event_name`, `reason`, `ip`, `useragent`, `created_at`) VALUES (1, 'login', '로그인 하였습니다.', '115.89.250.237', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/115...', '2023-08-02 03:54:59')
---
  def self.create_log(request, user_id, success=true, event_name, reason)
    UserLog.create(
      user_id: user_id,
      event_name: event_name,
      reason: reason,
      ip: request.remote_ip,
      useragent: request.user_agent[0..90] + "...",
      url: nil,
      referer: nil
    )