app/models/user.rb

SELECT `roles`.* FROM `roles` INNER JOIN `users_roles` ON `roles`.`id` = `users_roles`.`role_id` WHERE `users_roles`.`user_id` = 1 AND ((((roles.name = 'moderator') AND (roles.resource_type IS NULL) AND (roles.resource_id IS NULL)) OR ((roles.name = 'moderator') AND (roles.resource_type = 'Board') AND (roles.resource_id IS NULL))))
---
  def has_moderating_boards?(cached = true)
    if cached
      Rails.cache.fetch("user/#{self.cache_key}#role/has_moderating_boards?", expires_in:10.minute) {
        return has_moderating_boards?(false)
      }
    else
      return false if self.id.nil?
      return Board.with_role(:moderator, self).length > 0

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `user_data` SET `user_data`.`point` = 7680 WHERE `user_data`.`id` = 1
UPDATE `users` SET `users`.`updated_at` = '2023-08-02 03:54:59' WHERE `users`.`id` = 1
---
  def self.send_point_by_admin(to_user_id, point, desc)

    to_user = User.find(to_user_id)
    raise "unknown user" if to_user.nil?

    to_user.data.point += point
    to_user.data.save